Repository: haade-administrator/haade_panel_s504
Catalog: lib/l10n/app_*.arb
Languages: fr

# minimizeAppTooltip
source: Minimize the application
fr: Minimiser l'application

# appWillMinimize
source: The application will minimize
fr: L'application va se minimiser

source: Update launch failed
fr: Échec du lancement de la mise à jour

source: New version available
fr: Nouvelle version dispo

# checkUpdateTooltip
source: Check for update
fr: Vérifier mise à jour

# updateAvailableTitle
source: Update available
fr: Mise à jour disponible

# updateAvailableContent
source: A new version of the application is available. Would you like to download it?
fr: Une nouvelle version de l'application est disponible. Souhaitez-vous la télécharger ?

source: Cancel
fr: Annuler

source: Download
fr: Télécharger

source: No update available
fr: Aucune mise à jour disponible

# mqttSettingsTitle
source: MQTT Settings
fr: Paramètres MQTT

# mqttSettingsSubtitle
source: Configure the broker connection
fr: Configurer la connexion au broker

# ledControlTitle
source: LED & Sensor Control
fr: Contrôle LED & Capteurs

# ledControlSubtitle
source: Turn on/off and change the color
fr: Allumer/Éteindre et changer la couleur

# relaySwitchTitle
source: Relay Switches
fr: Interrupteurs Relais

# relaySwitchSubtitle
source: Controls relay switches
fr: Contrôle les interrupteurs relais

# ioButtonControlTitle
source: I/O Button
fr: Bouton I/O

# ioButtonControlSubtitle
source: Controls the in/out buttons
fr: Contrôle des boutons in/out

# parameterInformationTitle
source: Settings and Information
fr: Paramètres et Informatons

# parameterInformationSubtitle
source: Temperature, Humidity, and Brightness Sensors
fr: Capteurs de températures, humidités, luminosités

source: MQTT Settings
fr: Paramètres MQTT

source: Broker Address
fr: Adresse du broker

source: Username
fr: Nom d’utilisateur

source: Password
fr: Mot de passe

source: SSL Connection
fr: Connexion SSL

source: Save and Connect
fr: Enregistrer et connecter

source: Settings saved
fr: Paramètres enregistrés

# mqttConnected
source: Connected to MQTT broker
fr: Connecté au broker MQTT

source: MQTT connection error
fr: Erreur de connexion MQTT

source: Field required
fr: Champ obligatoire

source: Invalid port
fr: Port invalide

source: LED Color
fr: Couleur des LEDs

# brightnessLabel
source: Brightness
fr: Luminosité

# ledOnLabel
source: LED On
fr: LED allumée

source: Relay Control
fr: Contrôle des relais

# relay1Label
source: Relay 1 (IN1)
fr: Relais 1 (IN1)

# relay2Label
source: Relay 2 (IN2)
fr: Relais 2 (IN2)

# ioControlTitle
source: IO Control (Inputs/Outputs)
fr: Contrôle IO (Entrées / Sorties)

# io1Label
source: IO1 (Button 1)
fr: IO1 (Bouton 1)

# io2Label
source: IO2 (Button 2)
fr: IO2 (Bouton 2)

# modeOutput
source: Mode: Output (Push)
fr: Mode : Sortie (Poussoir)

source: Mode: Input
fr: Mode : Entrée

source: ACTIVE
fr: ACTIF

source: INACTIVE
fr: INACTIF

# triggerIo
source: Trigger IO{ioNumber}
fr: Déclencher IO{ioNumber}

# tempHumidity
source: Temperature / Humidity
fr: Température/Humidité

source: Brightness
fr: Luminosité

# sensorSettings
source: Settings & Infos
fr: Paramètres & Infos

source: Temperature
fr: Température

source: Humidity
fr: Humidité

# luxErrorValue
source: Invalid lux value
fr: Valeur de lux invalide

# luxDark
source: Dark
fr: Sombre

# luxDim
source: Dim light
fr: Lumière légère

# luxModerate
source: Moderate light
fr: Lumière modérée

# luxBright
source: Bright light
fr: Lumière forte

# luxVeryBright
source: Very bright light
fr: Très forte luminosité

# luxMeasuring
source: Measuring...
fr: Mesure en cours...

# luxAmbientTitle
source: Ambient Brightness
fr: Luminosité Ambiante
